#include <stdio.h>

int main() {
    char text[13] = "Hello, world";
    printf("123456789012345678901234567890\n");
    
    printf("%s\n", text);           // พิมพ์ข้อความตามปกติ
    printf("%20s\n", text);         // ชิดขวาในช่องกว้าง 20 ตัวอักษร
    printf("%.20s\n", text);        // พิมพ์สูงสุด 20 ตัวอักษรจาก text
    printf("%-20s\n", text);        // ชิดซ้ายในช่องกว้าง 20 ตัวอักษร
    printf("%-20.20s\n", text);     // ชิดซ้าย พิมพ์ไม่เกิน 20 ตัวอักษร
    printf("%.10s\n", text);        // ตัดให้เหลือแค่ 10 ตัวอักษร
    printf("%-10s\n", text);        // ชิดซ้ายในช่องกว้าง 10 ตัวอักษร
    printf("%25.10s\n", text);      // พิมพ์ไม่เกิน 10 ตัวอักษร ชิดขวาในช่องกว้าง 25
    printf("%25.5s\n", text);       // พิมพ์ไม่เกิน 5 ตัวอักษร ชิดขวาในช่องกว้าง 25
    printf("%-25.10s\n", text);     // พิมพ์ไม่เกิน 10 ตัวอักษร ชิดซ้ายในช่องกว้าง 25
    
    return 0;
}
